lisp/clbe/clbe-8.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-06 Mon 01:59 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Conditionals</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Ashok Khanna">
 <meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="preamble" class="status">
<div id="quote">Ashok Khanna</div>
<div id="home-link"><a href="/index.html">Home</a></div>
<div id="articles-link"><a href="/articles.html">Articles</a></div>
<div id="resources-link"><a href="/resources.html">Resources</a></div>
</div>
<div id="content">
<h1 class="title">Conditionals</h1>
<p>
Previous: <a href="clbe-7.html">7. Data Types</a>
</p>

<p>
Next: <a href="clbe-9.html">9. Basic Loops</a>
</p>

<p>
The five main conditionals in Common Lisp are <code>IF</code>, <code>WHEN</code>, <code>UNLESS</code>, <code>COND</code>
and <code>CASE</code>. Conditionals with an implicit PROGN block allow for multiple
forms within their bodies. To begin with an example of IF form (note
there is no implicit PROGN):
</p>


<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">if</span> (equal 5 (+ 1 4))
    (print <span style="color: #8b2252;">"This is true"</span>)
    (print <span style="color: #8b2252;">"This if false"</span>))

</pre>
</div>

<p>
Example of WHEN form (note there is an implicit PROGN):
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">when</span> (equal 5 (+ 1 4))
  (print <span style="color: #8b2252;">"Print if statement is true"</span>)
  (print <span style="color: #8b2252;">"Print this also"</span>))

</pre>
</div>

<p>
Example of UNLESS form (note there is an implicit PROGN):
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">unless</span> (equal 3 (+ 1 4))
  (print <span style="color: #8b2252;">"Only print if condition is false"</span>)
  (print <span style="color: #8b2252;">"Print this also"</span>))

</pre>
</div>

<p>
Example of COND form (multiple ifs, implicit PROGN). The form exits on
the first true:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">cond</span> ((equal 5 3) (print <span style="color: #8b2252;">"This will not print"</span>))
      ((equal 5 5) (print <span style="color: #8b2252;">"This will print"</span>))
      ((equal 5 5)
       (print <span style="color: #8b2252;">"This will not print as the"</span>)
       (print <span style="color: #8b2252;">"form exited at first true"</span>)))

</pre>
</div>

<p>
Example of a CASE form (multiple ifs on the one variable, implicit
PROGN). Cases are literal not evaluated. The form exits on the first true:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Try entering in 9 and then (* 3 3)</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">at the read prompt. Then try entering 0</span>

(<span style="color: #a020f0;">case</span> (read)
   ((1 3 5 7 9 (* 3 3)) <span style="color: #8b2252;">"Odd"</span>)
  (* 3 3)
  (0 <span style="color: #b22222;">; Note implicit PROGN here</span>
   (print <span style="color: #8b2252;">"Zero"</span>)
   (print <span style="color: #8b2252;">"Number"</span>))
  (otherwise <span style="color: #8b2252;">"Not a odd number &lt; 10"</span>))

</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="Date">Last updated: 24 July 2021</p><script src="/scripts/main.js"></script>
</div>
</body>
</html>
